app/controllers/ownerships_controller.rb

SELECT  `items`.* FROM `items` WHERE `items`.`code` = 'shirohato:10093186' LIMIT 1
INSERT INTO `items` (`code`, `name`, `url`, `image_url`, `created_at`, `updated_at`) VALUES ('beatnuts:10007665', '16-17 AA HARDWEAR DEPT JACKET ダブルエーハードウェア デプトチジャケット メンズ スノーウェア 721-163-05', 'http://item.rakuten.co.jp/beatnuts/10007665/', 'http://thumbnail.image.rakuten.co.jp/@0_mall/beatnuts/cabinet/aa/imgrc0069927548.jpg', '2018-01-31 16:02:01', '2018-01-31 16:02:01')
---
  def create
    @item = Item.find_or_initialize_by(code: params[:item_code])

    unless @item.persisted?
      # @item が保存されていない場合、先に @item を保存する
      results = RakutenWebService::Ichiba::Item.search(itemCode: @item.code)

      @item = Item.new(read(results.first))
      @item.save