app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @items = @user.items.uniq
    @count_want = @user.want_items.count
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT COUNT(*) FROM `items` INNER JOIN `ownerships` ON `items`.`id` = `ownerships`.`item_id` WHERE `ownerships`.`type` IN ('Want') AND `ownerships`.`user_id` = 1